{
  "start": {
    "dialogue": "Dude, I love playing Fortnite! I've been playing since day 1, even got the skull trooper skin!",
    "options": [
      {
        "trigger": "I don't really play Fortnite . . .",
        "pointer": "dont_fortnite"
      },
      {
        "trigger": "Yeah me too!",
        "pointer": "me_too_fortnite"
      },
      {
        "trigger": "Skull Trooper, more like Dull Trooper. Am I right?",
        "pointer": "dull_trooper"
      }
    ]
  },

  "dont_fortnite": {
    "dialogue": "Man, you totally should! I know Reddit says it's lame but don't listen to them, they don't know what true epicness is.",
    "options": [
      {
        "trigger": "No, I don't think I will",
        "pointer": "nomeggies"
      },
      {
        "trigger": "I guess I could give it a shot.",
        "pointer": "fortnite_ending"
      }
    ]
  },

  "me_too_fortnite": {
    "dialogue": "Dude, let's play some right fricken now",
    "options": [
      {
        "trigger": "Sure, I'm down",
        "pointer": "fortnite_ending"
      },
      {
        "trigger": "I'm not in the mood",
        "pointer": "thats_ok"
      }
    ]
  },

  "dull_trooper": {
    "dialogue": "Man, that's fricked up and actually just objectively wrong. See, for instance, Skulls are pretty based. Now troopers are a bit cringe, but it still is a net based rating. So apply that to the skin, volia:  Based Skin",
    "options": [
      {
        "trigger": "I ain't reading that shit",
        "pointer": "tl:dr"
      },
      {
        "trigger": "*Leave Mid-Sentence*",
        "pointer": "mid_sentence_ending"
      }
    ]
  },

  "tl:dr": {
    "dialogue": "Basically, I'm based and epic, and your'e cringe.\nSo sugma. . .",
    "options": [
      {
        "trigger": "What's sugma?",
        "pointer": "whats_sugma_ending"
      },
      {
        "trigger": "No you.",
        "pointer": "no_u_ending"
      }
    ]
  },

  "mid_sentence_ending": {
    "dialogue": "*You get up and leave*\nWait! Where are you going?! Hello?! I know you can hear me . . .",
    "options": null
  },

  "whats_sugma_ending": {
    "dialogue": "Ha ha ha. You've activated my trap card!\n*You just fucking explode. The last thing you hear is 'Sugma nuts.'*",
    "options": null
  },

  "no_u_ending": {
    "dialogue": "No, wait! That's im-impossible!! Argh! If it wern't for you meddling ki-\n*You shoot him in the head before he finishes his sentence.*",
    "options": null
  },

  "fortnite_ending": {
    "dialogue": "Ok, i'll go get us some drinks. Oh, by the way, my Mom's making some grilled cheese, want some?",
    "options": null
  },

  "thats_ok": {
    "dialogue": "That's ok, what else do you wanna play?",
    "options": [
      {
        "trigger": "Minecraft",
        "pointer": "minecraft_ending"
      },
      {
        "trigger": "Among Us",
        "pointer": "among_us_ending"
      },
      {
        "trigger": "Fall Guys",
        "pointer": "fall_guys_ending"
      },
      {
        "trigger": "Literally Anything Else",
        "pointer": "*_ending"
      }
    ]
  },

  "nomeggies": {
    "dialogue": "Oh, yeah? Well, see if I care, cause I don't. Yes, on god, I don't. Whatever I don't need you, I'll go play by myself . . .",
    "options": null
  },

  "minecraft_ending": {
    "dialogue": "Oh, that reminds me. I just set up a Minecraft server. Here i'll give you the IP. You brought your laptop right? . . .",
    "options": null
  },

  "fall_guys_ending": {
    "dialogue": "Here, I got it on my PS4, I'll go grab the second controller from my brother . . .",
    "options": null
  },

  "*_ending": {
    "dialogue": "I got this new game called Undertale. I think we should give it a go, but it is a singleplayer game. Here, how about this: I voice all the male characters, and you voice all the girl characters. Get it, cause you're a girl. Wait you are a girl, right? Wait wait, no, WAIT . . .",
    "options": null
  },

  "among_us_ending": {
    "dialogue": "STOP POSTING ABOUT AMONG US! I'M TIRED OF SEEING IT MY FRIENDS ON TIKTOK SEND ME MEMES, ON DISCORD IT'S FUCKING MEMES. I was in a server, right, and ALL OF THE CHANNELS ARE JUST AMONG US STUFF. I- I showed my Champion underwear to my girlfriend and the logo, I flipped it, 'Hey Babe, when the underwear sus!' HAHA. DING DING DING DING DING DING DING, DING-DING-DING. I fucking looked at a trash can and I said, 'That's a bit sussy.' I look at my penis, I think of the astronauts helmet and I GO PENIS!? MORE LIKE PEN-SUS AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA  . . . \n*You were ejected*",
    "options": null
  }
  
}