{
  "start": {
    "dialogue": "Dude, I love playing Fortnite! I've been playing since day 1, even got the skull trooper skin!",
    "options": [
      {
        "trigger": "I don't really play Fortnite . . .",
        "pointer": "dont_fortnite"
      },
      {
        "trigger": "Yeah me too!",
        "pointer": "me_too_fortnite"
      },
      {
        "trigger": "Skull Trooper, more like Dull Trooper. Am I right?",
        "pointer": "dull_trooper"
      }
    ]
  },

  "dont_fortnite": {
    "dialogue": "Man, you totally should! I know Reddit says it's lame but don't listen to them, they don't know what true epicness is.",
    "options": [
      {
        "trigger": "No, I don't think I will",
        "pointer": "nomeggies"
      },
      {
        "trigger": "I guess I could give it a shot.",
        "pointer": "fortnite_ending"
      }
    ]
  },

  "me_too_fortnite": {
    "dialogue": "Dude, let's play some right fricken now",
    "options": [
      {
        "trigger": "Sure, I'm down",
        "pointer": "fortnite_ending"
      },
      {
        "trigger": "I'm not in the mood",
        "pointer": "thats_ok"
      }
    ]
  },

  "dull_trooper": {
    "dialogue": "Dude, not cool. How would you like it if I made fun of your hobbies, huh? You think that would feel nice? No, it fucking wouldn't. Why can't you just let people enjoy things? You know, you're what's wrong with society these day. Fucking cringe this, cringe that, I thought cringe culture died 4 years ago! This is just fucking ridiculous. My biggest hobby, my favorite game; is this just a joke to you? You think I'm fucking laughing, huh?",
    "options": [
      {
        "trigger": "I ain't reading that shit",
        "pointer": "tl:dr"
      },
      {
        "trigger": "*Leave Mid-Sentence*",
        "pointer": "mid_sentence_ending"
      }
    ]
  },

  "tl:dr": {
    "dialogue": "What! I- I-, you- you know what? Fine have it your way. Gonna be a shame when the police have to come to your house and explain to your parent that you died in a ligma accident",
    "options": [
      {
        "trigger": "Who the hell is Steve Jobs?",
        "pointer": "steve_jobs_ending"
      },
      {
        "trigger": "What's ligma?",
        "pointer": "free_choice_is_a_lie_ending"
      }
    ]
  },

  "mid_sentence_ending": {
    "dialogue": "*You get up and leave*\nYeah that right, you're speechless. You're running away from your shortcomings. You know, I'm not the greatest man out there. Honestly, I'm kinda cringe. But at least I admit my follies. You don't think of yourself as anything other than perfect. 'Oh look at me, I have no flaws,' MAN FUCK YOU. THAT'S RIGHT: FUCK. YOU. YEAH, GO. CRY TO YOUR MOMMY, YOU'RE GONNA BE REAL SAD WHEN I PUT YOU AND YOUR WHOLE FAMILY INTO THE FUCKING DIRT, WHERE YOU BELONG. YOU HERE ME? *You walk away, feeling mildly uncomfortable. You imagine Monday at the lunch table will be awkward.*",
    "options": null
  },

  "steve_jobs_ending": {
    "dialogue": "Ligma Balls \n*You just fucking explode.*",
    "options": null
  },

  "free_choice_is_a_lie_ending": {
    "dialogue": "Ligma Balls \n*You still explode*",
    "options": null
  },

  "fortnite_ending": {
    "dialogue": "Ok, i'll go get us some drinks. Oh, by the way, my Mom's making some grilled cheese, want some?",
    "options": null
  },

  "thats_ok": {
    "dialogue": "That's ok, what else do you wanna play?",
    "options": [
      {
        "trigger": "Minecraft",
        "pointer": "minecraft_ending"
      },
      {
        "trigger": "Among Us",
        "pointer": "among_us_ending"
      },
      {
        "trigger": "Fall Guys",
        "pointer": "fall_guys_ending"
      },
      {
        "trigger": "Literally Anything Else",
        "pointer": "*_ending"
      }
    ]
  },

  "nomeggies": {
    "dialogue": "Oh, yeah? Well, see if I care, cause I don't. Yes, I don't. Whatever I don't need you, I'll go . . . play by myself, I guess . . .",
    "options": null
  },

  "minecraft_ending": {
    "dialogue": "Oh, that reminds me. I just set up a Minecraft server. Here i'll give you the IP. You brought your laptop right? No? Here I got it on Xbox, we can just play split-screen . . .",
    "options": null
  },

  "fall_guys_ending": {
    "dialogue": "Fuck Fall Guys bro, I'd rather play Overwatch. Get yo stupid ass out of my house! . . .",
    "options": null
  },

  "*_ending": {
    "dialogue": "I got this new game called Undertale. I think we should give it a go, but it is a singleplayer game. Here, how about this: I voice all the male characters, and you voice all the girl characters. Yes, we have to voice the characters, I'm gonna be uploading this let's play to Youtube! . . .",
    "options": null
  },

  "among_us_ending": {
    "dialogue": "STOP POSTING ABOUT AMONG US! I'M TIRED OF SEEING IT MY FRIENDS ON TIKTOK SEND ME MEMES, ON DISCORD IT'S FUCKING MEMES. I was in a server, right, and ALL OF THE CHANNELS ARE JUST AMONG US STUFF. I- I showed my Champion underwear to my girlfriend and the logo, I flipped it, 'Hey Babe, when the underwear sus!' HAHA. DING DING DING DING DING DING DING, DING-DING-DING. I fucking looked at a trash can and I said, 'That's a bit sussy.' I look at my penis, I think of the astronauts helmet and I GO PENIS!? MORE LIKE PEN-SUS AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA  . . . \n*You were ejected*",
    "options": null
  }
  
}